In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = ['2025-09-01', '2025-09-02', '2025-09-03', '2025-09-04', '2025-09-05', '2025-09-06', '2025-09-07']

In [3]:
datesI = pd.to_datetime(dates)

In [4]:
df1 = pd.DataFrame(np.random.randint(80, 100, (7,5)),
                   index = datesI,
                   columns = list('ABCDE'))

In [5]:
df1

             A   B   C   D   E
2025-09-01  91  84  95  88  85
2025-09-02  84  81  83  80  95
2025-09-03  81  88  81  89  93
2025-09-04  91  93  96  82  91
2025-09-05  99  89  89  90  89
2025-09-06  98  82  84  84  93
2025-09-07  96  89  85  82  90

In [6]:
?pd.DataFrame.rank

Signature:
pd.DataFrame.rank(
    self,
    axis: 'Axis' = 0,
    method: "Literal['average', 'min', 'max', 'first', 'dense']" = 'average',
    numeric_only: 'bool_t' = False,
    na_option: "Literal['keep', 'top', 'bottom']" = 'keep',
    ascending: 'bool_t' = True,
    pct: 'bool_t' = False,
) -> 'Self'
Docstring:
Compute numerical data ranks (1 through n) along axis.

By default, equal values are assigned a rank that is the average of the
ranks of those values.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Index to direct ranking.
    For `Series` this parameter is unused and defaults to 0.
method : {'average', 'min', 'max', 'first', 'dense'}, default 'average'
    How to rank the group of records that have the same value (i.e. ties):

    * average: average rank of the group
    * min: lowest rank in the group
    * max: highest rank in the group
    * first: ranks assigned in order they appear in the array
    * dense: like 'min', but rank always increases by 1 between groups.

numeric_only : bool, default False
    For DataFrame objects, rank only numeric columns if set to True.

    .. versionchanged:: 2.0.0
        The default value of ``numeric_only`` is now ``False``.

na_option : {'keep', 'top', 'bottom'}, default 'keep'
    How to rank NaN values:

    * keep: assign NaN rank to NaN values
    * top: assign lowest rank to NaN values
    * bottom: assign highest rank to NaN values

ascending : bool, default True
    Whether or not the elements should be ranked in ascending order.
pct : bool, default False
    Whether or not to display the returned rankings in percentile
    form.

Returns
-------
same type as caller
    Return a Series or DataFrame with data ranks as values.

See Also
--------
core.groupby.DataFrameGroupBy.rank : Rank of values within each group.
core.groupby.SeriesGroupBy.rank : Rank of values within each group.

Examples
--------
>>> df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
...                                    'spider', 'snake'],
...                         'Number_legs': [4, 2, 4, 8, np.nan]})
>>> df
    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

Ties are assigned the mean of the ranks (by default) for the group.

>>> s = pd.Series(range(5), index=list("abcde"))
>>> s["d"] = s["b"]
>>> s.rank()
a    1.0
b    2.5
c    4.0
d    2.5
e    5.0
dtype: float64

The following example shows how the method behaves with the above
parameters:

* default_rank: this is the default behaviour obtained without using
  any parameter.
* max_rank: setting ``method = 'max'`` the records that have the
  same values are ranked using the highest rank (e.g.: since 'cat'
  and 'dog' are both in the 2nd and 3rd position, rank 3 is assigned.)
* NA_bottom: choosing ``na_option = 'bottom'``, if there are records
  with NaN values they are placed at the bottom of the ranking.
* pct_rank: when setting ``pct = True``, the ranking is expressed as
  percentile rank.

>>> df['default_rank'] = df['Number_legs'].rank()
>>> df['max_rank'] = df['Number_legs'].rank(method='max')
>>> df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
>>> df['pct_rank'] = df['Number_legs'].rank(pct=True)
>>> df
    Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
0      cat          4.0           2.5       3.0        2.5     0.625
1  penguin          2.0           1.0       1.0        1.0     0.250
2      dog          4.0           2.5       3.0        2.5     0.625
3   spider          8.0           4.0       4.0        4.0     1.000
4    snake          NaN           NaN       NaN        5.0       NaN
File:      d:\anaconda3\lib\site-packages\pandas\core\generic.py
Type:      function

In [7]:
# Rank stocks in ascending order.
df1.rank(axis = 0) #Default

              A    B    C    D    E
2025-09-01  3.5  3.0  6.0  5.0  1.0
2025-09-02  2.0  1.0  2.0  1.0  7.0
2025-09-03  1.0  4.0  1.0  6.0  5.5
2025-09-04  3.5  7.0  7.0  2.5  4.0
2025-09-05  7.0  5.5  5.0  7.0  2.0
2025-09-06  6.0  2.0  3.0  4.0  5.5
2025-09-07  5.0  5.5  4.0  2.5  3.0

In [8]:
df1.rank(axis=1, ascending=False)

              A    B    C    D    E
2025-09-01  2.0  5.0  1.0  3.0  4.0
2025-09-02  2.0  4.0  3.0  5.0  1.0
2025-09-03  4.5  3.0  4.5  2.0  1.0
2025-09-04  3.5  2.0  1.0  5.0  3.5
2025-09-05  1.0  4.0  4.0  2.0  4.0
2025-09-06  1.0  5.0  3.5  3.5  2.0
2025-09-07  1.0  3.0  4.0  5.0  2.0

# Operations in pandas
## operations on objects and numerical values

In [9]:
S1 = pd.Series([1,2,3], index = list('abc'))

In [10]:
S1

a    1
b    2
c    3
dtype: int64

In [11]:
S1 + 3
#Element-wise operations.

a    4
b    5
c    6
dtype: int64

In [12]:
df2 = pd.DataFrame(np.arange(1,13).reshape((3,4)),
                   index = list('ABC'),
                   columns = list('abcd')
                  )

In [13]:
df2

   a   b   c   d
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

In [14]:
df2 * 3

    a   b   c   d
A   3   6   9  12
B  15  18  21  24
C  27  30  33  36

# Operations between objects
## Series operations: index alignment.

In [15]:
S1

a    1
b    2
c    3
dtype: int64

In [16]:
S2 = pd.Series([2,3,6], index = list('bcd'))

In [17]:
S2

b    2
c    3
d    6
dtype: int64

In [18]:
S1+S2

a    NaN
b    4.0
c    6.0
d    NaN
dtype: float64

# Operations between Series and DataFrame: alignment of Series index with DataFrame columns.

In [19]:
df1

             A   B   C   D   E
2025-09-01  91  84  95  88  85
2025-09-02  84  81  83  80  95
2025-09-03  81  88  81  89  93
2025-09-04  91  93  96  82  91
2025-09-05  99  89  89  90  89
2025-09-06  98  82  84  84  93
2025-09-07  96  89  85  82  90

In [20]:
df2

   a   b   c   d
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

In [21]:
df2 + S1
# S1 transpose→duplicate→alignment

      a     b     c   d
A   2.0   4.0   6.0 NaN
B   6.0   8.0  10.0 NaN
C  10.0  12.0  14.0 NaN

## Operations between DataFrames: alignment based on both index and columns.

In [22]:
df2

   a   b   c   d
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

In [23]:
df3 = pd.DataFrame(np.arange(1,13).reshape((4,3)),
                   index = list('BCDE'),
                   columns = list('cde'))

In [24]:
df3

    c   d   e
B   1   2   3
C   4   5   6
D   7   8   9
E  10  11  12

In [34]:
df2 * df3
#Intersection ; Overlap part

    a   b     c     d   e
A NaN NaN   NaN   NaN NaN
B NaN NaN   7.0  16.0 NaN
C NaN NaN  44.0  60.0 NaN
D NaN NaN   NaN   NaN NaN
E NaN NaN   NaN   NaN NaN

## Perform operations using methods

In [31]:
df2.add(df3)

    a   b     c     d   e
A NaN NaN   NaN   NaN NaN
B NaN NaN   8.0  10.0 NaN
C NaN NaN  15.0  17.0 NaN
D NaN NaN   NaN   NaN NaN
E NaN NaN   NaN   NaN NaN

In [32]:
df2 + df3

    a   b     c     d   e
A NaN NaN   NaN   NaN NaN
B NaN NaN   8.0  10.0 NaN
C NaN NaN  15.0  17.0 NaN
D NaN NaN   NaN   NaN NaN
E NaN NaN   NaN   NaN NaN

In [35]:
df2.add(df3, fill_value = 0)
# Fill first, then calculate.

     a     b     c     d     e
A  1.0   2.0   3.0   4.0   NaN
B  5.0   6.0   8.0  10.0   3.0
C  9.0  10.0  15.0  17.0   6.0
D  NaN   NaN   7.0   8.0   9.0
E  NaN   NaN  10.0  11.0  12.0

# The Index of Pandas
## Features of the index

In [37]:
df_dict = {
    '上海' : {2019:200000,2020:300000},
    '北京' : {2020:210000,2021:250000}
}

In [38]:
df_dict

{'上海': {2019: 200000, 2020: 300000}, '北京': {2020: 210000, 2021: 250000}}

In [39]:
df1 = pd.DataFrame(df_dict)

In [40]:
df1

            上海        北京
2019  200000.0       NaN
2020  300000.0  210000.0
2021       NaN  250000.0

In [41]:
df1.index

Index([2019, 2020, 2021], dtype='int64')

In [42]:
df1.columns

Index(['上海', '北京'], dtype='object')

In [43]:
df1.values

array([[200000.,     nan],
       [300000., 210000.],
       [    nan, 250000.]])

In [45]:
df1.index[0]

2019

In [46]:
df1.inde[0] = 2018

AttributeError: 'DataFrame' object has no attribute 'inde'

In [47]:
df1.columns[1] = '广州'

TypeError: Index does not support mutable operations

In [48]:
df1.columns[1]

'北京'

In [49]:
# Adding an index.
df1.insert(0, column = '广州', value=[120000,150000,180000])

In [50]:
df1

          广州        上海        北京
2019  120000  200000.0       NaN
2020  150000  300000.0  210000.0
2021  180000       NaN  250000.0

In [51]:
df1.insert(-1, column = '编号', value=[1,2,3])

ValueError: unbounded slice

In [53]:
len(df1.columns)

3

In [54]:
df1.insert(len(df1.columns), column = '编号', value = [1,2,3])

In [55]:
df1

          广州        上海        北京  编号
2019  120000  200000.0       NaN   1
2020  150000  300000.0  210000.0   2
2021  180000       NaN  250000.0   3

In [56]:
df1.drop('上海', axis = 1)

          广州        北京  编号
2019  120000       NaN   1
2020  150000  210000.0   2
2021  180000  250000.0   3

In [57]:
df1

          广州        上海        北京  编号
2019  120000  200000.0       NaN   1
2020  150000  300000.0  210000.0   2
2021  180000       NaN  250000.0   3

In [58]:
df2 = df1.drop('上海', axis = 1)

In [59]:
df2

          广州        北京  编号
2019  120000       NaN   1
2020  150000  210000.0   2
2021  180000  250000.0   3

In [61]:
df4 = df1.copy()

In [62]:
df4.drop('上海', errors = 'ignore')

          广州        上海        北京  编号
2019  120000  200000.0       NaN   1
2020  150000  300000.0  210000.0   2
2021  180000       NaN  250000.0   3

In [66]:
#delete row
df4.drop(2020)

          广州        上海        北京  编号
2019  120000  200000.0       NaN   1
2021  180000       NaN  250000.0   3

In [67]:
df4.drop(index = [2019,2020])

          广州  上海        北京  编号
2021  180000 NaN  250000.0   3

In [68]:
df4.drop(columns = ['编号'])

          广州        上海        北京
2019  120000  200000.0       NaN
2020  150000  300000.0  210000.0
2021  180000       NaN  250000.0

## Building a hierarchical index.

In [69]:
df5 = pd.DataFrame(
    np.arange(20).reshape(4,5),
    index = [
        ['one', 'one', 'two', 'two'], ['a', 'b', 'c', 'd']
    ],
    columns = [
        ['A', 'A', 'A', 'B', 'B'], [1,2,3,4,5]
    ])

In [70]:
df5

        A           B
        1   2   3   4   5
one a   0   1   2   3   4
    b   5   6   7   8   9
two c  10  11  12  13  14
    d  15  16  17  18  19

In [71]:
df5.index

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('two', 'c'),
            ('two', 'd')],
           )

In [72]:
df1.index

Index([2019, 2020, 2021], dtype='int64')

In [73]:
df5.columns

MultiIndex([('A', 1),
            ('A', 2),
            ('A', 3),
            ('B', 4),
            ('B', 5)],
           )

In [74]:
?pd.DataFrame.drop

Signature:
pd.DataFrame.drop(
    self,
    labels: 'IndexLabel | None' = None,
    *,
    axis: 'Axis' = 0,
    index: 'IndexLabel | None' = None,
    columns: 'IndexLabel | None' = None,
    level: 'Level | None' = None,
    inplace: 'bool' = False,
    errors: 'IgnoreRaise' = 'raise',
) -> 'DataFrame | None'
Docstring:
Drop specified labels from rows or columns.

Remove rows or columns by specifying label names and corresponding
axis, or by directly specifying index or column names. When using a
multi-index, labels on different levels can be removed by specifying
the level. See the :ref:`user guide <advanced.shown_levels>`
for more information about the now unused levels.

Parameters
----------
labels : single label or list-like
    Index or column labels to drop. A tuple will be used as a single
    label and not treated as a list-like.
axis : {0 or 'index', 1 or 'columns'}, default 0
    Whether to drop labels from the index (0 or 'index') or
    columns (1 or 'columns').
index : single label or list-like
    Alternative to specifying axis (``labels, axis=0``
    is equivalent to ``index=labels``).
columns : single label or list-like
    Alternative to specifying axis (``labels, axis=1``
    is equivalent to ``columns=labels``).
level : int or level name, optional
    For MultiIndex, level from which the labels will be removed.
inplace : bool, default False
    If False, return a copy. Otherwise, do operation
    in place and return None.
errors : {'ignore', 'raise'}, default 'raise'
    If 'ignore', suppress error and only existing labels are
    dropped.

Returns
-------
DataFrame or None
    Returns DataFrame or None DataFrame with the specified
    index or column labels removed or None if inplace=True.

Raises
------
KeyError
    If any of the labels is not found in the selected axis.

See Also
--------
DataFrame.loc : Label-location based indexer for selection by label.
DataFrame.dropna : Return DataFrame with labels on given axis omitted
    where (all or any) data are missing.
DataFrame.drop_duplicates : Return DataFrame with duplicate rows
    removed, optionally only considering certain columns.
Series.drop : Return Series with specified index labels removed.

Examples
--------
>>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
...                   columns=['A', 'B', 'C', 'D'])
>>> df
   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

Drop columns

>>> df.drop(['B', 'C'], axis=1)
   A   D
0  0   3
1  4   7
2  8  11

>>> df.drop(columns=['B', 'C'])
   A   D
0  0   3
1  4   7
2  8  11

Drop a row by index

>>> df.drop([0, 1])
   A  B   C   D
2  8  9  10  11

Drop columns and/or rows of MultiIndex DataFrame

>>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
...                              ['speed', 'weight', 'length']],
...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
>>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
...                         [250, 150], [1.5, 0.8], [320, 250],
...                         [1, 0.8], [0.3, 0.2]])
>>> df
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
        length  1.5     1.0
cow     speed   30.0    20.0
        weight  250.0   150.0
        length  1.5     0.8
falcon  speed   320.0   250.0
        weight  1.0     0.8
        length  0.3     0.2

Drop a specific index combination from the MultiIndex
DataFrame, i.e., drop the combination ``'falcon'`` and
``'weight'``, which deletes only the corresponding row

>>> df.drop(index=('falcon', 'weight'))
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
        length  1.5     1.0
cow     speed   30.0    20.0
        weight  250.0   150.0
        length  1.5     0.8
falcon  speed   320.0   250.0
        length  0.3     0.2

>>> df.drop(index='cow', columns='small')
                big
llama   speed   45.0
        weight  200.0
        length  1.5
falcon  speed   320.0
        weight  1.0
        length  0.3

>>> df.drop(index='length', level=1)
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
cow     speed   30.0    20.0
        weight  250.0   150.0
falcon  speed   320.0   250.0
        weight  1.0     0.8
File:      d:\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      function

In [77]:
df5.drop(index = 'one', level = 0)

        A           B
        1   2   3   4   5
two c  10  11  12  13  14
    d  15  16  17  18  19

In [78]:
df5.drop(index = 'one')

        A           B
        1   2   3   4   5
two c  10  11  12  13  14
    d  15  16  17  18  19

In [79]:
df5.drop(index = 'b')

KeyError: 'b'

In [80]:
df5.drop(index = 'b', level = 1)

        A           B
        1   2   3   4   5
one a   0   1   2   3   4
two c  10  11  12  13  14
    d  15  16  17  18  19

In [81]:
df5.drop(columns = [2,5], level = 1)

        A       B
        1   3   4
one a   0   2   3
    b   5   7   8
two c  10  12  13
    d  15  17  18

## Creation of an index object

In [83]:
df6 = pd.DataFrame(np.random.randint(10,50,(3,6)),
                   index = pd.Index(('人参', '当归', '枸杞'), name = '药品'),
                   columns = [
                       ['A'] * 3 + ['B'] * 3,
                       [1,2,3,1,2,3]
                   ]
                  )

In [84]:
df6

     A           B
     1   2   3   1   2   3
药品
人参  31  27  46  36  13  13
当归  39  35  39  38  25  19
枸杞  49  26  45  28  44  48

In [85]:
df6.columns.names = ['仓库', '编号']
df6

仓库   A           B
编号   1   2   3   1   2   3
药品
人参  31  27  46  36  13  13
当归  39  35  39  38  25  19
枸杞  49  26  45  28  44  48

In [86]:
df6.index

Index(['人参', '当归', '枸杞'], dtype='object', name='药品')

In [87]:
df6.columns

MultiIndex([('A', 1),
            ('A', 2),
            ('A', 3),
            ('B', 1),
            ('B', 2),
            ('B', 3)],
           names=['仓库', '编号'])

In [88]:
df6.drop(columns=3,level='编号')

仓库   A       B
编号   1   2   1   2
药品
人参  31  27  36  13
当归  39  35  38  25
枸杞  49  26  28  44

In [89]:
df6.to_excel('test.xlsx')